app/controllers/cables_controller.rb

SELECT "cables".* FROM "cables"
---
  def index
    render json: Cable.all

SELECT "cables".* FROM "cables" WHERE "cables"."id" = ? LIMIT ?  [["id", 18], ["LIMIT", 1]]
---
  def set_cable
    @cable = Cable.find_by_id(params[:id])