app/controllers/conduits_controller.rb

SELECT "conduits".* FROM "conduits"
---
  def index
    render json: Conduit.all

SELECT "conduits".* FROM "conduits" WHERE "conduits"."id" = ? LIMIT ?  [["id", 13], ["LIMIT", 1]]
---
  def set_conduit
    @conduit = Conduit.find_by_id(params[:id])