app/controllers/projects_controller.rb

SELECT "projects".* FROM "projects"
---
  def index
    render json: Project.all

INSERT INTO "projects" ("name", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["name", "PG&E"], ["created_at", "2024-07-17 04:45:13.382556"], ["updated_at", "2024-07-17 04:45:13.382556"], ["user_id", 1]]
---
  def create
    @project = Project.create(project_params)

UPDATE "projects" SET "name" = ?, "updated_at" = ? WHERE "projects"."id" = ?  [["name", "Excel"], ["updated_at", "2024-07-17 21:00:38.782862"], ["id", 4]]
---
  def update
    @project.update(project_params)

SELECT "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
  def set_project
    @project = Project.find_by_id(params[:id])