app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def set_user
    @user = User.find_by_id(params[:id])